Revit 2024 API
ViewScheduleExportOptions.ColumnHeaders Property
 How to export column headers. Default is MultipleRows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ExportColumnHeaders ColumnHeaders { get; set; }
Visual Basic
Public Property ColumnHeaders As ExportColumnHeaders
	Get
	Set
Visual C++
public:
property ExportColumnHeaders ColumnHeaders {
	ExportColumnHeaders get ();
	void set (ExportColumnHeaders value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace